## Lambda functions

In [1]:
#Normal function
def plus_one(x):
    return x + 1

In [2]:
print(plus_one(1))

2

In [3]:
#Lambda function 
lam_one = lambda x: x+1

In [4]:
print(lam_one(1))

2

## Scalar Values

In [5]:
(lambda x: x*2)(12)

24

## Lists

### Use with `filter()`

In [6]:
my_list = [1,2,3,4,5,6,7,8,9]
new_list = list(filter(lambda x: x%2==0, my_list))
new_list

[2, 4, 6, 8]

### Use with `map()`

In [7]:
birth_year = [1979, 1987, 2015, 2017]
age = list(map(lambda x: 2021-x, birth_year))
age

[42, 34, 6, 4]

In [8]:
float_nums = [0.3, 6.7, 8.5, 3.4, 9.0, 2.5, 3.45, 0.92]
rounded = map(lambda x:round(x, 1), float_nums)
list(rounded)

[0.3, 6.7, 8.5, 3.4, 9.0, 2.5, 3.5, 0.9]

## DataFrames

In [9]:
import pandas as pd

In [10]:
df = pd.DataFrame({
    'Name': ['Luke','Gina','Sam','Emma'],
    'Status': ['Father', 'Mother', 'Son', 'Daughter'],
    'Birthyear': [1976, 1984, 2013, 2016],
})

In [11]:
df

   Name    Status  Birthyear
0  Luke    Father       1976
1  Gina    Mother       1984
2   Sam       Son       2013
3  Emma  Daughter       2016

Use of `lambda` on a series object.

In [12]:
df['age'] = df['Birthyear'].apply(lambda x: 2021-x)

In [13]:
df

   Name    Status  Birthyear  age
0  Luke    Father       1976   45
1  Gina    Mother       1984   37
2   Sam       Son       2013    8
3  Emma  Daughter       2016    5

In [14]:
df['Gender'] = df['Status'].map(lambda x: 'Male' if x=='Father' or x=='Son' else 'Female')

In [15]:
df

   Name    Status  Birthyear  age  Gender
0  Luke    Father       1976   45    Male
1  Gina    Mother       1984   37  Female
2   Sam       Son       2013    8    Male
3  Emma  Daughter       2016    5  Female

Another way of creating `Gender` column (with conditions):

In [16]:
df['Gender'] = ''
df.loc[(df['Status'] == 'Father') | (df['Status'] == 'Son'), 'Gender'] = 'Male'
df.loc[(df['Status'] == 'Mother') | (df['Status'] == 'Daughter'), 'Gender'] = 'Female'

In [17]:
df

   Name    Status  Birthyear  age  Gender
0  Luke    Father       1976   45    Male
1  Gina    Mother       1984   37  Female
2   Sam       Son       2013    8    Male
3  Emma  Daughter       2016    5  Female

## `Lambda` on entire DataFrame

In [18]:
df2 = pd.DataFrame({
    'col1': [0.21, 2.34, 11.7345],
    'col2': [4.567, 1.98, 0.97],
    'col3': [6.5, 4.652, 9.12]
})

In [19]:
df2

      col1   col2   col3
0   0.2100  4.567  6.500
1   2.3400  1.980  4.652
2  11.7345  0.970  9.120

In [20]:
#round-off all data into 1 decimal place

df2.apply(lambda x:round(x,1))

   col1  col2  col3
0   0.2   4.6   6.5
1   2.3   2.0   4.7
2  11.7   1.0   9.1